#!/usr/bin/env python
# coding: utf-8

# решение задачи деда Мазая

# Ячейка № 1

# подключение библиотеки numpy
import numpy as np

# подключение библиотеки matplotlib.pyplot
import matplotlib.pyplot as plt


# Ячейка № 2

# задание функции, возвращающей
# координаты радиуса-вектора
# материальной точки, движущейся
# с постоянной скоростью V0
# вдоль прямой, образующей
# с осью абсцисс угол Teta
def R(R0, V0, Teta, t):
    # R0 - радиус-вектор материальной точки в момент времени t = 0
    # V0 -скорость движения материальной точки
    # Teta - угол между осью абсцисс и траекторией движения
    #        материальной точки
    # t - массив, содержащий координаты узлов временной сетки

    # определение числа узлов временной сетки
    Nt = len(t)

    # инициализация массивов, используемых для
    # хранения координат материальной точки,
    # вычисленных в узлах временной сетки
    X = np.zeros(Nt)
    Y = np.zeros(Nt)

    # вычисление значений координат
    # материальной точки
    # в заданные моменты времени
    X[:] = R0[0] + V0 * np.cos(Teta) * t[:]
    Y[:] = R0[1] + V0 * np.sin(Teta) * t[:]

    return X, Y

# Ячейка № 3

# задание числа выпущенных зайцев
Nz = 6

# задание номеров выпущенных зайцев
Nz1 = 1
Nz2 = 2
Nz3 = 3
Nz4 = 4
Nz5 = 5
Nz6 = 6

# задание радиуса-вектора точки, в которой
# находились зайцы в момент времени t = 0
r0 = np.zeros(2)

# задание углов между прямыми,
# вдоль которых двигаются зайцы
# в системе координат деда Мазая,
# и осью абсцисс
Teta1 = 2 * np.pi / Nz * (Nz1 - 1)
Teta2 = 2 * np.pi / Nz * (Nz2 - 1)
Teta3 = 2 * np.pi / Nz * (Nz3 - 1)
Teta4 = 2 * np.pi / Nz * (Nz4 - 1)
Teta5 = 2 * np.pi / Nz * (Nz5 - 1)
Teta6 = 2 * np.pi / Nz * (Nz6 - 1)

# задание модуля скорости движения зайцев
v0 = 1

# задание шага временной сетки
dt = 0.1
# вычисление координат узлов временной сетки
t = np.arange(0, 5, dt)

# определение числа узлов временной сетки
N = len(t)

# вычисление в узлах заданной временной сетки
# координат точек, в которых находятся зайцы
r1 = R(r0, v0, Teta1, t)
r2 = R(r0, v0, Teta2, t)
r3 = R(r0, v0, Teta3, t)
r4 = R(r0, v0, Teta4, t)
r5 = R(r0, v0, Teta5, t)
r6 = R(r0, v0, Teta6, t)

# визуализация траекторий движения зайцев
# в системе координат деда Мазая
fig1 = plt.figure(figsize=(7, 7))
plt.plot(r1[0], r1[1], "k", lw=1)
plt.plot(r1[0][N - 1], r1[1][N - 1], ">k")
plt.plot(r2[0], r2[1], "k", lw=1)
plt.plot(r2[0][N - 1], r2[1][N - 1], "<k")
plt.plot(r3[0], r3[1], "k", lw=1)
plt.plot(r3[0][N - 1], r3[1][N - 1], ">k")
plt.plot(r4[0], r4[1], "k", lw=1)
plt.plot(r4[0][N - 1], r4[1][N - 1], "<k")
plt.plot(r5[0], r5[1], "k", lw=1)
plt.plot(r5[0][N - 1], r5[1][N - 1], ">k")
plt.plot(r6[0], r6[1], "k", lw=1)
plt.plot(r6[0][N - 1], r6[1][N - 1], "<k")
plt.grid(True)

plt.show()

# визуализация траекторий движения зайцев в
# системе координат первого зайца
fig2 = plt.figure(figsize=(7, 7))
ax = plt.subplot(1, 2, 1)
plt.plot(r2[0] - r1[0], r2[1] - r1[1], "k", lw=1)
plt.plot(r2[0][N - 1] - r1[0][N - 1], r2[1][N - 1] - r1[1][N - 1], ">k")
plt.plot(r3[0] - r1[0], r3[1] - r1[1], "k", lw=1)
plt.plot(r3[0][N - 1] - r1[0][N - 1], r3[1][N - 1] - r1[1][N - 1], ">k")
plt.plot(r4[0] - r1[0], r4[1] - r1[1], "k", lw=1)
plt.plot(r4[0][N - 1] - r1[0][N - 1], r4[1][N - 1] - r1[1][N - 1], "<k")
plt.plot(r5[0] - r1[0], r5[1] - r1[1], "k", lw=1)
plt.plot(r5[0][N - 1] - r1[0][N - 1], r5[1][N - 1] - r1[1][N - 1], ">k")
plt.plot(r6[0] - r1[0], r6[1] - r1[1], "k", lw=1)
plt.plot(r6[0][N - 1] - r1[0][N - 1], r6[1][N - 1] - r1[1][N - 1], ">k")
plt.grid(True)
ax.set_title("a)", fontsize=9)

# визуализация зависимостей расстояний
# между зайцами в выбранной системе координат
# от времени
ax = plt.subplot(1, 2, 2)
plt.plot(t, np.sqrt((r2[0] - r1[0]) ** 2 + (r2[1] - r1[1]) ** 2), "k")
plt.plot(t, np.sqrt((r3[0] - r1[0]) ** 2 + (r3[1] - r1[1]) ** 2), "k")
plt.plot(t, np.sqrt((r4[0] - r1[0]) ** 2 + (r4[1] - r1[1]) ** 2), "k")
plt.plot(t, np.sqrt((r5[0] - r1[0]) ** 2 + (r5[1] - r1[1]) ** 2), "k")
plt.plot(t, np.sqrt((r6[0] - r1[0]) ** 2 + (r6[1] - r1[1]) ** 2), "k")
plt.grid(True)
ax.set_title("б)", fontsize=9)

plt.show()
